let newsList = [
{"id":"12","img":"../static/image/erweima.jpg","title":"硅造技术的现状与发展 ","date":"2019-04-04","page":"根据全球主要铸件生产国2004年的产量统计可以看出，十比重大。另一类是发达国家，如日本、美国及欧洲等，他们采用高新技术主要生产高附加值铸件据全球主要铸件生产国2004年的产量统计可以看出，十比重大。另一类是发达国家，如日本、美国及欧洲等，他们采用高新技术主要生产高附加值据全球主要铸件生产国2004年的产量统计可以看出，十比重大。另一类是发达国家，如日本、美国及欧洲等，他们采用高新技术主要生产高附加值据全球主要铸件生产国2004年的产量统计可以看出，十比重大。另一类是发达国家，如日本、美国及欧洲等，他们采用高新技术主要生产高附加值。"},
{"id":"13","img":"../static/image/erweima.jpg","title":"硅造技术的现状与发展 ","date":"2019-04-04","page":"根据全球主要铸件生产国2004年的产量统计可以看出，十比重大。另一类是发达国家，如日本、美国及欧洲等，他们采用高新技术主要生产高附加值铸件据全球主要铸件生产国2004年的产量统计可以看出，十比重大。另一类是发达国家，如日本、美国及欧洲等，他们采用高新技术主要生产高附加值据全球主要铸件生产国2004年的产量统计可以看出，十比重大。另一类是发达国家，如日本、美国及欧洲等，他们采用高新技术主要生产高附加值。"},
{"id":"14","img":"../static/image/erweima.jpg","title":"硅造技术的现状与发展 ","date":"2019-04-04","page":"根据全球主要铸件生产国2004年的产量统计可以看出，十比重大。另一类是发达国家，如日本、美国及欧洲等，他们采用高新技术主要生产高附加值铸据全球主要铸件生产国2004年的产量统计可以看出，十比重大。另一类是发达国家，如日本、美国及欧洲等，他们采用高新技术主要生产高附加值据全球主要铸件生产国2004年的产量统计可以看出，十比重大。另一类是发达国家，如日本、美国及欧洲等，他们采用高新技术主要生产高附加值件。"},
{"id":"15","img":"../static/image/erweima.jpg","title":"硅造技术的现状与发展 ","date":"2019-04-04","page":"根据全球主要铸件生产国2004年的产量统计可以看出，十比重大。另一类是发达国家，如日本、美国及欧洲等，他们采用高新技术主要生产高附加值据全球主要铸件生产国2004年的产量统计可以看出，十比重大。另一类是发达国家，如日本、美国及欧洲等，他们采用高新技术主要生产高附加值铸据全球主要铸件生产国2004年的产量统计可以看出，十比重大。另一类是发达国家，如日本、美国及欧洲等，他们采用高新技术主要生产高附加值件。"},
{"id":"16","img":"../static/image/erweima.jpg","title":"硅造技术的现状与发展 ","date":"2019-04-04","page":"根据全球主要铸件生产国2004年的产量统计可以看出，十比重大。另一类是发达国家，如日本、美国及欧洲等，他们采用高新技术主要生产高附加值铸据全球主要铸件生产国2004年的产量统计可以看出，十比重大。另一类是发达国家，如日本、美国及欧洲等，他们采用高新技术主要生产高附加值据全球主要铸件生产国2004年的产量统计可以看出，十比重大。另一类是发达国家，如日本、美国及欧洲等，他们采用高新技术主要生产高附加值件。"},
{"id":"17","img":"../static/image/erweima.jpg","title":"硅造技术的现状与发展 ","date":"2019-04-04","page":"根据全球主要铸件生产国2004年的产量统计可以看出，十比重大。另一类是发达国家，如日本、美国及欧洲等，他们采用高新技术主要生产高附加值据全球主要铸件生产国2004年的产量统计可以看出，十比重大。另一类是发达国家，如日本、美国及欧洲等，他们采用高新技术主要生产高附加值据全球主要铸件生产国2004年的产量统计可以看出，十比重大。另一类是发达国家，如日本、美国及欧洲等，他们采用高新技术主要生产高附加值铸件。"}
]


let pageList = [
{"id":"12","img":"../static/image/6f2q.jpg","title":"硅造技术的现状与发展","time":"2019-04-4","p1":"发达国家总体上铸造技术先进、产品质量好、生产效率高、环境污染小、原辅材料已形成系列化。欧洲已建立跨国服务系统，生产实现机械化、自动化、智能化。生产过程从严执行技术标准，铸件废品率约为2%—5%。重视用信息化提升铸造工艺设计水平，普遍应用软件进行充型凝固过程模拟和工艺优化设计。","p2":"　从批量和劳动生产率看，欧、美、日的优势很大，日本的劳动生产率是人均年产铸件140吨，我国估计约为20吨，相差7倍。我国人工成本低于1美元/小时，与发达国家相差几十倍，因而出口铸件具有优势。但近年来材料价格猛涨，使我国出口铸件在材料成本方面的优势消失殆尽。在产品质量和档次方面，我们远落后于发达国家。近年我国铸件出口虽有所增长，但出口只占我国总产量的97%，占世界铸件市场流通量不到8%，总体增速缓慢，表现为质量较差、价格低。长期以来，出口的铸件以中低档产品为主，各类管件、散热器、厨具及浴具占到36%。一些出口铸件虽可达到国际标准，但要达到欧美客户标准还有距离。"},
{"id":"13","img":"../static/image/6f2q.jpg","title":"硅造技术的现状与发展","time":"2019-04-4","p1":"发达国家总体上铸造技术先进、产品质量好、生产效率高、环境污染小、原辅材料已形成系列化。欧洲已建立跨国服务系统，生产实现机械化、","p2":"1235454"},
{"id":"14","img":"../static/image/6f2q.jpg","title":"硅造技术的现状与发展","time":"2019-04-4","p1":"发达国家总体上铸造技术先进、产品质量好、生产效率高、环境污染小、原辅材料已形成系列化。欧洲已建立跨国服务系统，生产实现机械化、","p2":"1235454"},
{"id":"15","img":"../static/image/6f2q.jpg","title":"硅造技术的现状与发展","time":"2019-04-4","p1":"发达国家总体上铸造技术先进、产品质量好、生产效率高、环境污染小、原辅材料已形成系列化。欧洲已建立跨国服务系统，生产实现机械化、","p2":"1235454"},
{"id":"16","img":"../static/image/6f2q.jpg","title":"硅造技术的现状与发展","time":"2019-04-4","p1":"发达国家总体上铸造技术先进、产品质量好、生产效率高、环境污染小、原辅材料已形成系列化。欧洲已建立跨国服务系统，生产实现机械化、","p2":"1235454"},
{"id":"17","img":"../static/image/6f2q.jpg","title":"硅造技术的现状与发展","time":"2019-04-4","p1":"发达国家总体上铸造技术先进、产品质量好、生产效率高、环境污染小、原辅材料已形成系列化。欧洲已建立跨国服务系统，生产实现机械化、","p2":"1235454"}

]
$(()=>{
	$("#foot").load("foot.html")
	$("#head").load("head.html")
  	
    
	//数据初始
	 $.each(newsList,function(key,value){
   	 let list = $(`<div class="media" index =${value.id}><div class="media-left media-middle"> <a href="#"><img class="media-object" src="${value.img}"></a></div>
   	 <div class="media-body"><h4 class="media-heading">${value.title}&nbsp;&nbsp;<i>${value.date}</i></h4><div class="news_media_body"> ${value.page}</div></div></div>`)
     $(".news_list").append(list);
    })
	 
	 //进入详情
	$('.media').on('click',function(){
		$('.news_list').addClass('news_hide');
    	$('.newslist_detail').removeClass('news_hide');
    	let id = $(this).attr("index");
    	$.each(pageList,function(key,value){
    		if (id==value.id){
    			let list = $(`<p>${value.title}</p><p>${value.time}<a class="bank_news">返回列表</a></p><div class="newslist_page"><img src="${value.img}" class="newslist_detail_img"/>
    			<p>${value.title}</p><p>44545445455</p></div>`);
    			$('.newslist_detail').append(list);	
    		}
    	})
	})
	//返回
	$('.bank_news').on('click',function(){
	console.log(122)
	$('.newslist_detail').addClass('news_hide');
	$('.news_list').removeClass('news_hide');
	})
	 
})
$(document).ready(function () {
  var swiper = new Swiper('.swiper-container', {
  	 loop: true, // 循环模式选项
  	    autoplay:{
    	stopOnLastSlide:true
     },
      spaceBetween: 30,
      effect: 'fade',
      pagination: {
        el: '.swiper-pagination',
        clickable: true,
      },
    });
      var swiper2 = new Swiper('.swiper-container-two', {
	  	loop: true, // 循环模式选项
	    autoplay:{
		stopOnLastSlide:true
		 },
		effect: 'flip',
		grabCursor: true,
		pagination: {
		el: '.swiper-pagination',
		},
});

})